#  1) Establish a connection between Python and the Sakila database.

In [9]:
import mysql.connector
cnct = mysql.connector.connect()

from getpass import getpass
password = getpass()

cnct = mysql.connector.connect(user = 'root',
                             password = password,
                             host = 'localhost',
                             database = 'sakila')

········

In [10]:
cnct.is_connected()

True

In [11]:
from sqlalchemy import create_engine

# 2)

# Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame.

- engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
- month: an integer representing the month for which rental data is to be retrieved.
- year: an integer representing the year for which rental data is to be retrieved.

The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [23]:
pwd = getpass()
engine = create_engine(f"mysql+pymysql://root:{pwd}@localhost/sakila")
import pandas as pd

········

In [26]:

def rentals_month(engine, month, year):
    # Define the SQL query to retrieve rental data for the specified month and year
    
    query = f""" SELECT rental_id, MONTH(rental_date) as Month, 
                 YEAR(rental_date) as Year, inventory_id, 
                 customer_id, staff_id, last_update
                FROM rental
                WHERE MONTH(rental_date) = {month} and YEAR(rental_date) = {year}
                """

    rental_data = pd.read_sql_query(query, engine)

    return rental_data

In [29]:
df= rentals_month(engine,5,2005)
df

,rental_id,Month,Year,inventory_id,customer_id,staff_id,last_update
0,1,5,2005,367,130,1,2006-02-15 21:30:53
1,2,5,2005,1525,459,1,2006-02-15 21:30:53
2,3,5,2005,1711,408,1,2006-02-15 21:30:53
3,4,5,2005,2452,333,2,2006-02-15 21:30:53
4,5,5,2005,2079,222,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,5,2005,2725,506,2,2006-02-15 21:30:53
1152,1154,5,2005,2732,59,1,2006-02-15 21:30:53
1153,1155,5,2005,2048,251,2,2006-02-15 21:30:53
1154,1156,5,2005,460,106,2,2006-02-15 21:30:53
1155,1157,5,2005,1449,61,1,2006-02-15 21:30:53

# 3)

Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

In [30]:
def rental_count_month(df, month, year):
    # Group the DataFrame by customer_id and count the number of rentals for each customer
    rentals_count = df.groupby('customer_id').size().reset_index(name=f'rentals_{month:02d}_{year}')

    return rentals_count

In [31]:
rental_count_month(df,5,2005)

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

# 4)

Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [50]:
query = """ SELECT MONTH(rental_date) as Month, 
           YEAR(rental_date) as Year, customer_id, COUNT(rental_id)
            FROM rental
            WHERE MONTH(rental_date) = 5 and YEAR(rental_date) = 2005
            GROUP BY customer_id, MONTH(rental_date), YEAR(rental_date)
            ORDER BY customer_id DESC;
            """

df005 = pd.read_sql_query(query, engine)

In [51]:
df005

     Month  Year  customer_id  COUNT(rental_id)
0        5  2005          599                 1
1        5  2005          597                 2
2        5  2005          596                 6
3        5  2005          595                 1
4        5  2005          594                 4
..     ...   ...          ...               ...
515      5  2005            6                 3
516      5  2005            5                 3
517      5  2005            3                 2
518      5  2005            2                 1
519      5  2005            1                 2

[520 rows x 4 columns]

In [53]:
query = """ SELECT MONTH(rental_date) as Month, 
            YEAR(rental_date) as Year, customer_id, COUNT(rental_id)
            FROM rental
            WHERE MONTH(rental_date) = 6 and YEAR(rental_date) = 2005
            GROUP BY customer_id, MONTH(rental_date), YEAR(rental_date)
            ORDER BY customer_id DESC;
            """

df006 = pd.read_sql_query(query, engine)

In [54]:
df006

     Month  Year  customer_id  COUNT(rental_id)
0        6  2005          599                 4
1        6  2005          598                 1
2        6  2005          597                 3
3        6  2005          596                 2
4        6  2005          595                 2
..     ...   ...          ...               ...
585      6  2005            5                 5
586      6  2005            4                 6
587      6  2005            3                 4
588      6  2005            2                 1
589      6  2005            1                 7

[590 rows x 4 columns]

In [62]:
mergedf = pd.merge(df005,df006, on='customer_id', how="outer")
mergedf

,Month_x,Year_x,customer_id,COUNT(rental_id)_x,Month_y,Year_y,COUNT(rental_id)_y
0,5.0,2005.0,599,1.0,6.0,2005.0,4.0
1,5.0,2005.0,597,2.0,6.0,2005.0,3.0
2,5.0,2005.0,596,6.0,6.0,2005.0,2.0
3,5.0,2005.0,595,1.0,6.0,2005.0,2.0
4,5.0,2005.0,594,4.0,6.0,2005.0,6.0
...,...,...,...,...,...,...,...
593,NaN,NaN,31,NaN,6.0,2005.0,11.0
594,NaN,NaN,30,NaN,6.0,2005.0,4.0
595,NaN,NaN,15,NaN,6.0,2005.0,3.0
596,NaN,NaN,13,NaN,6.0,2005.0,4.0
597,NaN,NaN,4,NaN,6.0,2005.0,6.0

In [68]:

def compare_rentals(df1, df2):
    # Merge DataFrames on 'customer_id'
    merged_df = pd.merge(df1, df2, on='customer_id', how='outer')

    # Fill NaN values with 0, as NaN may occur if a customer has rentals in one month but not the other
    merged_df = merged_df.fillna(0)

    # Calculate the difference between the number of rentals in the two months
    merged_df['difference'] = merged_df['COUNT(rental_id)_y'] - merged_df['COUNT(rental_id)_x']

    return merged_df

In [69]:
compare_rentals(df005,df006)

,Month_x,Year_x,customer_id,COUNT(rental_id)_x,Month_y,Year_y,COUNT(rental_id)_y,difference
0,5.0,2005.0,599,1.0,6.0,2005.0,4.0,3.0
1,5.0,2005.0,597,2.0,6.0,2005.0,3.0,1.0
2,5.0,2005.0,596,6.0,6.0,2005.0,2.0,-4.0
3,5.0,2005.0,595,1.0,6.0,2005.0,2.0,1.0
4,5.0,2005.0,594,4.0,6.0,2005.0,6.0,2.0
...,...,...,...,...,...,...,...,...
593,0.0,0.0,31,0.0,6.0,2005.0,11.0,11.0
594,0.0,0.0,30,0.0,6.0,2005.0,4.0,4.0
595,0.0,0.0,15,0.0,6.0,2005.0,3.0,3.0
596,0.0,0.0,13,0.0,6.0,2005.0,4.0,4.0
597,0.0,0.0,4,0.0,6.0,2005.0,6.0,6.0

If negative, the customer rented more movies the previous month.
If positive, the customer rented more movies this month.